# Team standings

Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

Write a query to return the scores of each team in the teams table after all matches displayed in the matches table. Points are awarded as follows: zero points for a loss, one point for a tie, and three points for a win. The result should include team name and points, and be ordered by decreasing points. In case of a tie, order by alphabetized team name.

In [2]:
%run Question.ipynb

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.
 * postgresql://fknight:***@localhost/postgres
Done.
Done.
6 rows affected.
6 rows affected.

In [13]:
%%sql

SELECT * FROM teams

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, 'New York'),
 (2, 'Atlanta'),
 (3, 'Chicago'),
 (4, 'Toronto'),
 (5, 'Los Angeles'),
 (6, 'Seattle')]

# Part A

Write a query to convert the matches into points.

In [4]:
%%sql

# Suggested answer

SELECT 
    *, 
    CASE 
        WHEN host_goals > guest_goals THEN 3 
        WHEN host_goals = guest_goals THEN 1
        ELSE 0 END AS host_points,
    
    CASE 
        WHEN host_goals < guest_goals THEN 3
        WHEN host_goals = guest_goals THEN 1
        ELSE 0 END AS guest_points
FROM matches

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[(1, 1, 2, 3, 0, 3, 0),
 (2, 2, 3, 2, 4, 0, 3),
 (3, 3, 4, 4, 3, 3, 0),
 (4, 4, 5, 1, 1, 1, 1),
 (5, 5, 6, 2, 1, 3, 0),
 (6, 6, 1, 1, 2, 0, 3)]

# Part B

Using the subquery from Part A, determine the number of points each team earned as the host team.

```sql
WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS host_points,

        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS guest_points
    FROM matches 
)
```

In [12]:
%%sql

WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END 
        AS host_points,
        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END 
        AS guest_points
    FROM matches
)

SELECT t.city, p.host_points
FROM teams t
    JOIN points p
    ON t.id = p.host_team

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[('New York', 3),
 ('Atlanta', 0),
 ('Chicago', 3),
 ('Toronto', 1),
 ('Los Angeles', 3),
 ('Seattle', 0)]

# Part C

Using the subquery from Part A, determine the number of points each team earned as the guest team.

```sql
WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS host_points,

        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS guest_points
    FROM matches 
)
```

In [11]:
%%sql

WITH points AS (
    SELECT 
        *,
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END 
        AS host_points,
        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END 
        AS guest_points
    FROM matches
)

SELECT t.city, p.guest_points
FROM teams t
    JOIN points p
    ON t.id = p.guest_team

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[('New York', 3),
 ('Atlanta', 0),
 ('Chicago', 3),
 ('Toronto', 0),
 ('Los Angeles', 1),
 ('Seattle', 0)]

# Part D

Use the subquery from Part A to solve the original problem.

```sql
WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS host_points,

        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS guest_points
    FROM matches 
)
```

In [15]:
%%sql

WITH points AS (
    SELECT 
        *, 
        CASE 
            WHEN host_goals > guest_goals THEN 3 
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS host_points,

        CASE 
            WHEN host_goals < guest_goals THEN 3
            WHEN host_goals = guest_goals THEN 1
            ELSE 0 END AS guest_points
    FROM matches 
)

SELECT t.city, a.host_points + b.guest_points AS total_points 
FROM teams t
    JOIN points a
    ON t.id = a.host_team
    JOIN points b
    ON t.id = b.guest_team
ORDER BY total_points DESC, city ASC

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[('Chicago', 6),
 ('New York', 6),
 ('Los Angeles', 4),
 ('Toronto', 1),
 ('Atlanta', 0),
 ('Seattle', 0)]

## The full solution is given below

In [3]:
%%sql

-- add host points and guest points columns to matches table, 
-- using case-when-then to tally up points for wins, ties, and losses

WITH t1 AS (
SELECT 
    *, 
    CASE 
        WHEN host_goals > guest_goals THEN 3 
        WHEN host_goals = guest_goals THEN 1
        ELSE 0 END AS host_points,
    
    CASE 
        WHEN host_goals < guest_goals THEN 3
        WHEN host_goals = guest_goals THEN 1
        ELSE 0 END AS guest_points
FROM matches 
)

-- join result onto teams table twice to add up for each team the 
-- points earned as host team and guest team, then order as requested

SELECT t.city, a.host_points + b.guest_points AS total_points 
FROM teams t
    JOIN t1 a
    ON t.id = a.host_team
    JOIN t1 b
    ON t.id = b.guest_team
ORDER BY total_points DESC, city ASC

 * postgresql://fknight:***@localhost/postgres
6 rows affected.

[('Chicago', 6),
 ('New York', 6),
 ('Los Angeles', 4),
 ('Toronto', 1),
 ('Atlanta', 0),
 ('Seattle', 0)]